*** Entity: =Company=

#+name: Company-schema
#+BEGIN_SRC ruby :results code :eval no-export :exports none
[
  { 
    name: "name",
    entity: "company",
    description: "name of company",
  },
]
#+END_SRC

#+name: Company-synopsis
#+BEGIN_SRC raw :exports code
Organization collecting timeoff data
#+END_SRC

Attributes:

#+name: Company-attributes
#+BEGIN_SRC ruby :eval no-export :results output :noweb yes :exports results
<<interface-common>>
puts schemaAttributes(<<Company-schema()>> )
#+END_SRC

#+RESULTS: Company-attributes
: name: name of company

  
